var paragraph = new String('A paragraph is a self-contained unit of writing');

let arr=[1,2]
arr.push(3,4);
console.log(arr);


/*
a)

console.table([paragraph]);
console.log(typeof paragraph);
console.log(`This is the final Paragraph : "${paragraph}" `); 

┌─────────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┬─────┐
│ (index) │ 0   │ 1   │ 2   │ 3   │ 4   │ 5   │ 6   │ 7   │ 8   │ 9   │ 10  │ 11  │ 12  │ 13  │ 14  │ 15  │ 16  │ 17  │ 18  │ 19  │ 20  │ 21  │ 22  │ 23  │ 24  │ 25  │ 26  │ 27  │ 28  │ 29  │ 30  │ 31  │ 32  │ 33  │ 34  │ 35  │ 36  │ 37  │ 38  │ 39  │ 40  │ 41  │ 42  │ 43  │ 44  │ 45  │ 46  │
├─────────┼─────┼─────┼─────┼─────┼─────┼─────┼─────┼─────┼─────┼─────┼─────┼─────┼─────┼─────┼─────┼─────┼─────┼─────┼─────┼─────┼─────┼─────┼─────┼─────┼─────┼─────┼─────┼─────┼─────┼─────┼─────┼─────┼─────┼─────┼─────┼─────┼─────┼─────┼─────┼─────┼─────┼─────┼─────┼─────┼─────┼─────┼─────┤
│ 0       │ 'A' │ ' ' │ 'p' │ 'a' │ 'r' │ 'a' │ 'g' │ 'r' │ 'a' │ 'p' │ 'h' │ ' ' │ 'i' │ 's' │ ' ' │ 'a' │ ' ' │ 's' │ 'e' │ 'l' │ 'f' │ '-' │ 'c' │ 'o' │ 'n' │ 't' │ 'a' │ 'i' │ 'n' │ 'e' │ 'd' │ ' ' │ 'u' │ 'n' │ 'i' │ 't' │ ' ' │ 'o' │ 'f' │ ' ' │ 'w' │ 'r' │ 'i' │ 't' │ 'i' │ 'n' │ 'g' │
└─────────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┴─────┘
object
This is the final Paragraph : "A paragraph is a self-contained unit of writing" 
*/


/*
b)
var newparagraph = 'Paragraphs organize longer texts, providing structure, unity, and readability. ';
console.table([newparagraph,typeof newparagraph]);

┌─────────┬───────────────────────────────────────────────────────────────────────────────────┐
│ (index) │ Values                                                                            │
├─────────┼───────────────────────────────────────────────────────────────────────────────────┤
│ 0       │ 'Paragraphs organize longer texts, providing structure, unity, and readability. ' │
│ 1       │ 'string'                                                                          │
└─────────┴───────────────────────────────────────────────────────────────────────────────────┘
******************************************************************************************************************************************************************
c)
🔹 What is at()?
        at() is a safe indexing method to access elements from:
        Array,String,TypedArray
        It supports positive and negative indexes.

        at() allows accessing elements using negative indexing in arrays and strings, which is not possible with bracket notation.

 1)let arr = [10, 20, 30, 40];
console.table([arr[3],arr[-1]]);

┌─────────┬───────────┐
│ (index) │ Values    │
├─────────┼───────────┤
│ 0       │ 40        │
│ 1       │ undefined │
└─────────┴───────────┘   

2)let arr = [10, 20, 30, 40];
console.table([arr[0],arr[-1],arr.at(-1)]);

┌─────────┬───────────┐
│ (index) │ Values    │
├─────────┼───────────┤
│ 0       │ 10        │
│ 1       │ undefined │
│ 2       │ 40        │
└─────────┴───────────┘

3)let name = "Harsh";
console.table([name.at(0),name.at(-2)]);

┌─────────┬────────┐
│ (index) │ Values │
├─────────┼────────┤
│ 0       │ 'H'    │
│ 1       │ 's'    │
└─────────┴────────┘

Note:  Comparison with old traditional way
    arr[arr.length - 1]; // old    ||          arr.at(-1);          // modern & clean

*******************************************************************************************************************************************************************************    
🔹 What is big()?

big() is a String HTML wrapper method.
It returns a string wrapped inside the <big> HTML tag, which displays text one font size larger.

let text = "Hello";                   |         let text = new String('Hello');
console.log(text.big());              |         console.log(text.big()); 

Output should be same in both way :  <big>Hello</big>
Note:
1)bold()     // <b>     <b>Hello</b>
2)italics()  // <i>      <i> Hello  </i>
3)small()    // <small>   <small>Hello</small>
4)fontcolor()      <font color="red">Hello</font>
5)fontsize()        <font size="5">Hello</font>    (sizerange 1 to 7)

Combined Example:
       document.body.innerHTML =
      "Harsh".bold().italics().fontcolor("green").fontsize(5);


      <font size="5" color="green">
        <i><b>Harsh</b></i>
      </font>
**************************************************************************************************************************************************************************
🔹 What is concat()?
  concat() combines values and returns a new string/array without mutating the original. 
   It does not mutate the original array; it returns a new array, so the operation is immutable.
 
  
1)var value=[1,2].concat([3,4]); // same result
console.log(value);   //it return the string   [ 1, 2, 3, 4 ]

2)let arr=[1,2]
var value=arr.concat([3,4]); // same result
console.log(arr);                     //  [ 1, 2 ]
console.log(value);                   //  [ 1, 2, 3, 4 ]

3)let FirstName=new String('Harsh ');
let LastName=new String('Dixit');

let result=FirstName.concat(LastName);
console.table([result,FirstName,LastName]);

┌─────────┬─────┬─────┬─────┬─────┬─────┬─────┬───────────────┐
│ (index) │ 0   │ 1   │ 2   │ 3   │ 4   │ 5   │ Values        │
├─────────┼─────┼─────┼─────┼─────┼─────┼─────┼───────────────┤
│ 0       │     │     │     │     │     │     │ 'Harsh Dixit' │
│ 1       │ 'H' │ 'a' │ 'r' │ 's' │ 'h' │ ' ' │               │
│ 2       │ 'D' │ 'i' │ 'x' │ 'i' │ 't' │     │               │
└─────────┴─────┴─────┴─────┴─────┴─────┴─────┴───────────────┘

NOTE: Return a new String and Operation is mutable

Q)If we want to string mutuable   what to do ?? 

we use push() in js only for array

let FirstName=new String('Harsh ');  //String object wrapper
let LastName=new String('Dixit');
FirstName.push(LastName);
console.log(FirstName);           // TypeError: FirstName.push is not a function

*****************************************************************Listen Push() method always used in array not in string*****************************************************************
let arr=[1,2]
arr.push(3,4);
console.log(arr);     //[ 1, 2, 3, 4 ]



*/ 